Neosinerji.BABOnlineTP.Business/Service References/AkSigorta/PolicePDFSorgulamaWebService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://policePDFSorgulama.police.webServices.aksigorta.tr.com/" name="/policeBasimBilgileri/PolicePDFSorgulamaWebService" targetNamespace="http://policePDFSorgulama.police.webServices.aksigorta.tr.com/" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://testapi.aksigorta.com.tr/service/aa368c022b98868d2b2e389d8dec2762?serviceoid=94c2dead2f0b9e8a7bec046e237b3bf7&amp;servdocoid=94c2dead2f0b9e8a7bec046e237b3c37" namespace="http://policePDFSorgulama.police.webServices.aksigorta.tr.com/" />
    </xsd:schema>
  </types>
  <message name="policePDFSorgulama">
    <part name="parameters" element="tns:policePDFSorgulama" />
  </message>
  <message name="policePDFSorgulamaResponse">
    <part name="parameters" element="tns:policePDFSorgulamaResponse" />
  </message>
  <portType name="PolicePDFSorgulamaWebService">
    <operation name="policePDFSorgulama">
      <input message="tns:policePDFSorgulama" />
      <output message="tns:policePDFSorgulamaResponse" />
    </operation>
  </portType>
  <binding name="PolicePDFSorgulamaWebServiceImplPortBinding" type="tns:PolicePDFSorgulamaWebService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="policePDFSorgulama">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="/policeBasimBilgileri/PolicePDFSorgulamaWebService">
    <port name="PolicePDFSorgulamaWebServiceImplPort" binding="tns:PolicePDFSorgulamaWebServiceImplPortBinding">
      <soap:address location="https://testapi.aksigorta.com.tr/api/policePDFSorgulamaWS-V2.0/PolicePDFSorgulamaWebService" />
    </port>
  </service>
</definitions>